
* Ikiwiki plugin
** sh
*** DONE Figure out why files are not being properly cleaned up
    CLOSED: [2011-12-06 Tue 09:48]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2011-12-06 Tue 09:48]
    :END:
**** Is it because ikiwiki is not cleaning up stdout when exiting?
      
** lisp
*** DONE Use less CPU when waiting on a file
    CLOSED: [2011-12-03 Sat 08:52]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2011-12-03 Sat 08:52]
    :END:
**** Possibly sleep for a short amount of time.
*** DONE Figure out why it doesn't work from a daemonized emacs
    CLOSED: [2011-12-14 Wed 21:44]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2011-12-14 Wed 21:44]
    CLOCK: [2011-12-14 Wed 19:02]--[2011-12-14 Wed 19:15] =>  0:13
    CLOCK: [2011-12-14 Wed 18:34]--[2011-12-14 Wed 18:35] =>  0:01
    - State "STARTED"    from "TODO"       [2011-12-14 Wed 18:17]
    CLOCK: [2011-12-14 Wed 18:17]--[2011-12-14 Wed 18:34] =>  0:17
    :END:
*** DONE Write scan and linkify procedures
    CLOSED: [2011-12-06 Tue 14:38]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2011-12-06 Tue 14:38]
    CLOCK: [2011-12-06 Tue 14:33]--[2011-12-06 Tue 14:38] =>  0:05
    CLOCK: [2011-12-06 Tue 09:48]--[2011-12-06 Tue 10:26] =>  0:38
    CLOCK: [2011-12-03 Sat 18:21]--[2011-12-03 Sat 20:13] =>  1:52
    - State "STARTED"    from "TODO"       [2011-12-03 Sat 08:52]
    CLOCK: [2011-12-03 Sat 08:52]--[2011-12-03 Sat 09:50] =>  0:58
    :END:
*** TODO Allow proper customization
*** DONE Test pictures hosted locally
    CLOSED: [2011-12-15 Thu 11:03]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2011-12-15 Thu 11:03]
    - State "STARTED"    from "TODO"       [2011-12-15 Thu 10:47]
    CLOCK: [2011-12-15 Thu 10:47]--[2011-12-15 Thu 11:03] =>  0:16
    :END:
*** TODO Allow for slashes before wikilinks
** readme
*** DONE Remove warnings about alpha state
    CLOSED: [2011-12-16 Fri 11:22]
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2011-12-16 Fri 11:22]
    - State "STARTED"    from "TODO"       [2011-12-16 Fri 11:11]
    CLOCK: [2011-12-16 Fri 11:11]--[2011-12-16 Fri 11:22] =>  0:11
    :END:
*** DONE Put in link to blog
    CLOSED: [2011-12-16 Fri 11:19]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2011-12-16 Fri 11:19]
    :END:
*** DONE Reword installation to reflect sh is now working
    CLOSED: [2011-12-16 Fri 11:20]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2011-12-16 Fri 11:20]
    :END:
